# Package Pandas  

Digunakan untuk pengolahan data yang berkaitan dengan data frame.

In [1]:
# Lakukan import pandas sebagai pd
import pandas as pd

In [2]:
# Lakukan import numpy sebagai np
import numpy as np

## 1. Membuat dataframe

Untuk membuat data frame, digunakan sintaks berikut: `pandas.DataFrame( data, index, columns, dtype, copy)`  
1. index merupakan label untuk baris   
2. columns merupakan label untuk kolom
3. dtype merupakan tipe data perkolom
4. copy digunakan untuk menyalin data, defaultnya False

In [3]:
# Membuat rentang waktu
tanggal = pd.date_range("20200901", freq="M", periods=9)
print(tanggal)

DatetimeIndex(['2020-09-30', '2020-10-31', '2020-11-30', '2020-12-31',
               '2021-01-31', '2021-02-28', '2021-03-31', '2021-04-30',
               '2021-05-31'],
              dtype='datetime64[ns]', freq='M')

In [4]:
# Membuat data frame dengan data random ukuran 9x4, serta label baris adalah tanggal dan label kolom A, B, C, D
contoh1 = pd.DataFrame(np.random.randn(9,4), index=tanggal, columns=("A","B","C","D"))
contoh1

                   A         B         C         D
2020-09-30 -0.067267 -0.709860  0.387654  0.677074
2020-10-31  0.201267 -1.136603 -0.767407 -0.189269
2020-11-30  1.092486  0.368111  0.700373 -0.603299
2020-12-31 -1.372058 -1.261350  1.185856  0.234144
2021-01-31  0.836012 -0.770147 -0.769220 -0.338956
2021-02-28  1.872806  0.038028 -2.707070 -0.683642
2021-03-31  0.835834  1.236048 -0.344895 -0.345168
2021-04-30 -0.788410 -1.108857  0.676523 -0.085311
2021-05-31  0.852753 -0.426726  1.421790 -0.410002

In [5]:
# Membuat dataframe dengan daftar anggota
contoh2 = pd.DataFrame({"A": 1.,
                       "B": pd.Timestamp("20180925"),
                       "C": np.array([3]*4, dtype="int32"),
                       "D": pd.Categorical(["test","train"]*2),
                       "E": np.array([1,12,32,14])}, index=["satu","dua","tiga","empat"])
contoh2

         A          B  C      D   E
satu   1.0 2018-09-25  3   test   1
dua    1.0 2018-09-25  3  train  12
tiga   1.0 2018-09-25  3   test  32
empat  1.0 2018-09-25  3  train  14

## 2. Menambah, menghapus, dan menyeleksi kolom data frame

Menghapus kolom dengan fungsi:  
1. `del(data_frame["kolom"])` 
2. `.pop("kolom")`
3. `.drop("kolom", axis=1)`; axis=1 berarti menghapus sepanjang kolom yang dimaksud

Menambahkan kolom baru dengan operasi matematis "+"

In [6]:
# Menambahkan kolom baru dengan nama "F", dengan operasi penambahan kolom "C" dan "E"
contoh2["F"]=contoh2["C"]+contoh2["E"]
print(contoh2)

         A          B  C      D   E   F
satu   1.0 2018-09-25  3   test   1   4
dua    1.0 2018-09-25  3  train  12  15
tiga   1.0 2018-09-25  3   test  32  35
empat  1.0 2018-09-25  3  train  14  17

In [7]:
# Menambahkan kolom baru dengan nama "G", pada index satu, tiga, empat 
contoh2["G"]=pd.Series([10,20,30], index=["satu", "tiga", "empat"])
print(contoh2)

         A          B  C      D   E   F     G
satu   1.0 2018-09-25  3   test   1   4  10.0
dua    1.0 2018-09-25  3  train  12  15   NaN
tiga   1.0 2018-09-25  3   test  32  35  20.0
empat  1.0 2018-09-25  3  train  14  17  30.0

In [8]:
# Menghapus kolom "B" dengan fungsi del
del(contoh2["B"])
contoh2

         A  C      D   E   F     G
satu   1.0  3   test   1   4  10.0
dua    1.0  3  train  12  15   NaN
tiga   1.0  3   test  32  35  20.0
empat  1.0  3  train  14  17  30.0

In [9]:
# Menghapus kolom "C" dengan pop
contoh2.pop("C")
contoh2

         A      D   E   F     G
satu   1.0   test   1   4  10.0
dua    1.0  train  12  15   NaN
tiga   1.0   test  32  35  20.0
empat  1.0  train  14  17  30.0

In [10]:
# Menyeleksi kolom "A"
kolomA = contoh2["A"]
kolomA

satu     1.0
dua      1.0
tiga     1.0
empat    1.0
Name: A, dtype: float64

In [11]:
# Menghapus kolom "A" dengan fungsi drop
contoh2_hapus = contoh2.drop("A", axis = 1)
contoh2_hapus.head()

           D   E   F     G
satu    test   1   4  10.0
dua    train  12  15   NaN
tiga    test  32  35  20.0
empat  train  14  17  30.0

## 3. Menambah, mengurang, dan menyeleksi baris pada data frame

Menyeleksi/mengiris data frame dengan fungsi:
1. `loc`: untuk seleksi dengan menggunakan indeks/bilangan bulat
2. `iloc`: untuk seleksi dengan menggunakan bilangan bulat

Menambah baris dengan fungsi: `.append()`

Menghapus baris dengan fungsi: `.del("index", axis=0)`, axis=0 berarti menghapus sepanjang baris.

In [12]:
# Menambah baris menggunakan fungsi append
contoh3 = pd.DataFrame([[1,"train",4,5,6.0], [2,"test",7,12,34]], columns=["A","D","E","F","G"])
contoh3

contoh4 = contoh2.append(contoh3)
contoh4

         A      D   E   F     G
satu   1.0   test   1   4  10.0
dua    1.0  train  12  15   NaN
tiga   1.0   test  32  35  20.0
empat  1.0  train  14  17  30.0
0      1.0  train   4   5   6.0
1      2.0   test   7  12  34.0

In [13]:
# Menyeleksi indeks "tiga" pada baris
contoh4.loc["tiga"]

A       1
D    test
E      32
F      35
G      20
Name: tiga, dtype: object

In [14]:
# Menyeleksi baris ke 2 dan 3, dengan menyebut urutannya, kemudian mengcopy hasilnya
contoh5=contoh4.iloc[1:3].copy()
contoh5

        A      D   E   F     G
dua   1.0  train  12  15   NaN
tiga  1.0   test  32  35  20.0

In [15]:
# Menghapus baris dengan indeks "tiga". Simpan variabel dengan nama "contoh5_hapus"
contoh5_hapus = contoh5.drop("tiga", axis=0)
contoh5_hapus

       A      D   E   F   G
dua  1.0  train  12  15 NaN

## 4. Menyeleksi/megiris data frame berdasar baris dan kolom

In [16]:
contoh2

         A      D   E   F     G
satu   1.0   test   1   4  10.0
dua    1.0  train  12  15   NaN
tiga   1.0   test  32  35  20.0
empat  1.0  train  14  17  30.0

In [17]:
# mengiris data baris dan kolom
contoh2.iloc[1:3, 2:5]

       E   F     G
dua   12  15   NaN
tiga  32  35  20.0

In [18]:
# Menampilkan informasi pada data frame
contoh2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, satu to empat
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   D       4 non-null      category
 2   E       4 non-null      int32
 3   F       4 non-null      int32
 4   G       3 non-null      float64
dtypes: category(1), float64(2), int32(2)
memory usage: 388.0+ bytes

### Fungsi dasar untuk series  


Berikut fungsi dasar untuk series (deret)  

No   | Fungsi   | Deskripsi
:---:|:---      |:---   
1    | axes     | Daftar label baris dan kolom |
2    | dtypes   | Daftar tipe data setiap kolom |
3    | empty    | Akan bernilai True jika deret ada yang kosong |
4    | size     | Ukuran dari data |
5    | values   | Mengubah deret menjadi ndarray (n dimensional array) |
6    | head()   | Menampilkan n data pertama |
7    | tail()   | Menampilkan n data terakhir |

In [ ]:
# cobalah fungsi axes, dtypes, empty, size, head, tail untuk contoh2

## 5. Mengimport atau membaca file (csv, xls)

In [1]:
# Membaca file xls. File terletak dalam satu folder dengan notebook jupyter
superstore = pd.read_excel("Superstore.xls")
superstore.head()

NameError: name 'pd' is not defined

In [ ]:
# Gunakan fungsi dasar untuk series, untuk melihat informasi tabel
superstore.empty

In [ ]:
superstore.dtypes

In [ ]:
# Ukuran data frame (baris, kolom)
superstore.shape

In [ ]:
# Ukuran data frame 
superstore.size

In [ ]:
# apakah tipe data superstore? Gunakan fungsi type
type(superstore)

In [ ]:
# Gunakan fungsi .info() untuk mengetahui gambaran data superstore
superstore.info()

In [ ]:
# Pilih kolom "Product Name", dan simpan dalam variabel produk

produk = superstore['Product Name']
produk.head(10)

In [ ]:
# Menjadikan series ke array dengan .values
produk.values

In [ ]:
# Memilih baris kelipatan 3, dengan semua kolom. Kemudian tampilkan 10 data pertama
superstore.iloc[::3,:].head(10)

In [ ]:
# Menyeleksi data dengan Kota adalah "Semarang". Kemudian tampilkan 5 data pertama
semarang = superstore[superstore.Kota == "Semarang"]
semarang.head(5)

## 6. Menambahkan kolom baru pada data frame

In [ ]:
# Tambahkan kolom "Garansi", dan isikan semua baris dengan "Tidak Bergaransi"
superstore["Garansi"] = "Tidak bergaransi"
superstore.head(3)

In [ ]:
# Seleksi kolom Customer ID, Kota, Sub-Category, dan Profit. Simpan dalam variabel superstore2
superstore2 = superstore[["Customer ID", "Kota", "Sub-Category", "Profit"]]
superstore2.head(5)

In [ ]:
# Seleksi superstore2, yang Kota adalah Semarang, memiliki Profit lebih dari 20. Simpan dalam superstore2_filter. 
superstore2_filter = superstore2[(superstore2.Kota == "Semarang") & (superstore2.Profit > 20)] 
superstore2_filter.head()

In [ ]:
# Berapakah data yang sesuai dengan kondisi setelah dilakukan filtering? 
superstore2_filter.count()